package com.sasamijp.osusystem;

import android.content.Intent;
import android.content.res.Resources;
import android.os.Bundle;
import android.app.Activity;
import android.util.Log;
import android.view.View;
import android.widget.*;


import java.io.*;

/**
 * Created by seiya on 14/03/06.
 */

public class SubActivity extends Activity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {

        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_sub);
        Intent i = getIntent();
        final String keyword = i.getStringExtra("KEYWORD");

        TextView textview1 = (TextView)findViewById(R.id.textView);
        ArrayAdapter<String> adapter = new ArrayAdapter<String>(this, android.R.layout.simple_list_item_1);
        textview1.setText("Result of " + keyword);

        String[] susiroMenues = {"特ネタ本鮪中とろ","炙り焼き鮭ハラス","塩だれびん長鮪腹身","とろサーモン","上やりいかいくらのせ","駿河湾盛り","たらフライガーリック醤油","北海道産上いくら","炙り上穴子塩すだ    ち","北海道産貝柱いくらのせ","特ネタ本鮪赤身","店内ゆで天然大えび","漬け真鯛ごましょうゆ","あんかけ茶碗蒸し","瀬戸内産たこ串天ぷら","いちごみるくパフェ","よくばりチーズケー    キ","練乳いちごケーキ","炙りぶりしゃぶ","ぶりとろ","中とろ","鮭チャンチャン焼","大うなぎ","活〆大えび","赤えび","炙り赤えび塩レモン","マーラー風味赤えび","中とろ","サーモン","焼とろサーモン","サーモンちーず","まぐろ","寒ぶり","たい","えんがわ","〆さば","さんま香味にぎり","あじ","えび","甘えび","えびチーズ","えびアボカド","えび天にぎり","ほたて貝柱","つぶ貝","いか","やりいか姿","たこ","生たこ","うなぎ","煮あなご","なす田楽にぎり","かにカマ天にぎり","たまご","数の子","牛塩カルビ","わさびなす","生ハム","焼豚ねぎまみれ","軍艦ねぎまぐろ","まぐろ山かけ","鰹ユッケ","軍艦甘えび","蟹かにマヨ軍艦","いくら","とびこ軍艦","たらマヨ","数の子松前漬け","コーン","ツナサラダ","カニ風サラダ","シーサラダ","なっとう","ミートボール","ごまあじ軍艦","鉄火巻","きゅうり巻","かんぴょう巻","ねぎま巻","新香巻","梅しそきゅうり巻","炙り赤えび塩レモン","マーラー風味赤えび","炙りぶりしゃぶ","鮭チャンチャン焼","サーモンちーず","えびアボカド","えびチーズ","えび天にぎり","かにカマ天にぎり","さんま香味にぎり","牛塩カルビ","焼豚ねぎまみれ","生ハム","なす田楽にぎり","ごまあじ軍艦","ミートボール","えび天うどん","かけうどん","きつねうどん","釜玉うどん","肉うどん","絶品カレーうどん","魚の赤だし","蛤の赤だし","あさりたっぷりのみそ汁","あんかけ茶碗蒸し","茶碗蒸し","だし巻き玉子","シーザーサラダ","コーンスープ","丸ごと海老の柚子こしょう天ぷら","鶏のからあげ","たこの唐揚げ","なんこつ唐揚げ","かぼちゃの天ぷら","フライドポテト","いちごみるくパフェ","チョコバナナパフェ","抹茶わらびもちパフェ","チョコアイス","バニラアイス","抹茶アイス","ストロベリーアイス","フローズンマンゴー","チョコケーキ","よくばりチーズケーキ","練乳いちごケーキ","エッグタルト","大学いも","とろっとプリン","パンナコッタ","抹茶わらびもち","生ビール","瓶ビール","梅酒","日本盛吟醸","オールフリー（ノンアルコールビール）","ソフトドリンク"};
        String[] kappaMenues = {"うに帆立炙り","とろサーモン炙り","とろ〆さば炙り","サーモンマヨ炙り","ぶりとろ炙りポン酢ジュレのせ","いか明太","まぐろたたき明太軍艦","サーモンねぎ塩ロール","大人のまぐたくロール","炙りびんちょうガーリック","えんがわチャンジャ風","まぐろステーキ中華ソース","熱々！子持ちししゃもフライ","プレミアムプリン","プレミアムホイッププリン","果汁100%バレンシアオレンジゼリー","あん肝（ポン酢ジュレ）","鴨スモーク","豚の角煮","真いかげそ","数の子旨みかつお","照り焼きチキン","わさび茄子旨みかつお","納豆おろし軍艦","大人の納豆巻","温かい厚焼き（大根おろし）","まぐろ","サーモン","とろサーモン","焼サーモン","サーモン(玉ねぎ無)","ぶり","ぶりとろ","とろ〆さば","生たこ","えんがわ","つぶ貝","煮穴子","うなぎ","漬けまぐろステーキ","うなぎ厳選一貫","海老","甘海老","あおりいか","姿やりイカ","真いか","あじ","とろ〆さば","いわし","厚焼き","玉子","いか旨みかつお（するめいか）","温かい厚焼き（大根おろし）","わさびなす","サーモンアボカド","いわし（ごま）","えんがわ（ごま）","真いか（ごま）","海老天握り","ハンバーグ","牛カルビ","ジャンボいか天握り","海老天握り（おろし）","海老アボカド","豚の角煮","照り焼きチキン","わさび茄子旨みかつお","コーン","かにみそ軍艦","シーフードサラダ","いくら","うに","まぐたく","まぐろたたき","やまかけ","国産牛しぐれ煮軍艦","いかおくら","たたき軍艦","納豆軍艦","サラダ","海老サラダ軍艦","納豆おろし軍艦","いなり","鉄火巻","かっぱ巻","納豆巻","ツナ巻","梅きゅう巻","たくあん巻","干ぴょう巻","海老天巻き","魚の竜田ロール","まぐろたたき巻","特撰茶碗蒸し","あおさの汁物(米みそ)","はまぐりの汁物(米みそ)","魚の竜田揚げ","鶏軟骨から揚げ","フライドポテト","たこ焼き","海老天うどん","きつねうどん","わかめうどん","かき揚げうどん","オニオンスライス","100%ジュース(オレンジ)","100%ジュース(アップル)","100%ジュース(グレープ)","生ビール","瓶ビール","ノンアルコールビール","チョコケーキ","チョコバナナケーキ","ホワイトケーキ（イチゴソース）","ホイッププリン","チョコムース","【プレミアム】バニラアイスクリーム","ベイクドチーズケーキ","紅あずまのスイートケーキ","洋なしキャラメルケーキ"};
        String[] kuraMenues = {"熟成【天然】まぐろ","【天然】まぐろいくら添え","漬けまぐろ","ビントロ","活け〆真だい","はまち","【天然】　真いわし","【天然】　真いわし酢〆","サーモン","オニオンサーモン","焼>きはらす","とろサーモン","そでいか","大葉甲いか","大葉真いか","えんがわにぎり（かれい）","えび","甘えび","えびアボカド","生えび","真たこ","大葉生たこ","ほたて貝柱","つぶ貝","たまご焼き","あなご","いなり","佐世保レモンステーキ風","えび天寿司","究極のかにかま","肉厚とろ〆さば","みる貝","ハンバーグにぎり","真いかジュレポン酢","サーモンジュレポン酢","えんがわジュ>レポン酢","あぶりえんがわ塩レモン","土佐ゆず牛カルビ","姿やりいか","","ふぐにぎり（一貫）（一部店舗限定）","まぐろ中とろ（一貫）","赤えび（一貫）","うなぎ厚切り1貫","かににぎり(一貫）","【高知県産】レモンぶり（一貫）","【徳島県産】すだちぶり(一貫)","【天然】あじ（一貫）","まぐろユッケ手巻き寿司（一貫）","","ねぎまぐろ","まぐろユッケ","味付いく>ら","うに","納豆","えびマヨ","サラダ","ツナサラダ","7種のシーフードサラダ","コーン","味玉軍艦","海鮮ねぎ塩軍艦","カラフトししゃもっこ軍艦","【くら特製】ほたてうに軍艦","たら白子ジュレポン酢軍艦","いか明太軍艦","極旨サーモン軍艦","","あぶりサーモンガーリックバター風味","あぶり豚ガーリックバター風味","あぶりえびチーズ","あぶりチーズサーモン","あぶりチーズ豚カルビ","鉄火巻","きゅうり巻","納豆巻","かんぴょう巻","えび天手巻き寿司","いか天手巻き寿司（一貫）","ぷち寿司","","7種の魚介醤油らーめん（関西）","7種の魚介醤油らーめん（関東）","7種の魚介とんこつ醤油らーめん（関西）","7種の魚介とんこつ醤油らーめん（関東）","7種の魚介旨辛醤油らーめん（関西）","7種の魚介旨辛醤油らーめん（関東）","7種の魚介旨辛とんこつ醤油らーめん（関西）","7種の魚介旨辛とんこつ醤油らーめん（関東）","きつねうどん","讃岐風釜玉うどん","かけうどん（平日限定）","すしやの天丼","熟成まぐろ>丼","特製茶碗蒸し","あさり入り赤だし","あさり入り味噌汁【関東・九州】","あさり入り味噌汁【北陸】","京風　だし巻きたまご","スモークサーモンの生春巻き","とろ～りチーズグラ>タン","もりもりポテト","天ぷら盛り合わせ","いか天","えび天","オニオンリング","ちびころチキン","とうもろこしのかき揚げ","京わらびもち","京わらびもち（九州）","京風ぜんざいはじめました。","おしるこはじめました。","カリカリさつまいも","北海道みるくシューアイス","チーズケーキ","チョコケーキ（関西）","チョコケーキ（関東）","チョコケーキ（九州）","ミルクレープ","フォンダン・ショコラムース","贅沢プリンパフェ","濃厚チョコバナナパフェ","なめらか豆乳アイス","まるごと果実シャーベット　巨峰","まるごと果実シャーベット　メロン","まるごと果実シャーベット　いちご","生ビール","瓶ビール","ドライゼロα（ノンアルコールビール）","冷酒無添蔵","りんごジュース","みかんジュース","緑茶むてん","イタリアンティラミス","京風あんぶらん","ニューヨークチーズケーキ","プレミアアイス珈琲","プレミアアイスラテ","プレミアホット珈琲","プレミアホットラテ","季節のパイン"};

        boolean susiroSales = false;
        boolean kappaSales = false;
        boolean kuraSales = false;

        for(String neta : susiroMenues){
            if (neta.indexOf(keyword) != -1){
                susiroSales = true;
            }
        }

        for(String neta : kappaMenues){
            if(neta.indexOf(keyword) != -1){
                kappaSales = true;
            }
        }

        for(String neta : kuraMenues){
            if(neta.indexOf(keyword) != -1){
                kuraSales = true;
            }
        }

        if(susiroSales){
            adapter.add("スシローで販売:している");
        }else{
            adapter.add("スシローで販売:していない");
        }

        if(kappaSales){
            adapter.add("かっぱ寿司で販売:している");
        }else{
            adapter.add("かっぱ寿司で販売:していない");
        }

        if(kuraSales){
            adapter.add("くら寿司で販売:している");
        }else{
            adapter.add("くら寿司で販売:していない");
        }

        ListView listView = (ListView) findViewById(R.id.listView);
        listView.setAdapter(adapter);
        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                //ここに処理を書く
                //Toast.makeText(SubActivity.this, String.valueOf(position), Toast.LENGTH_SHORT).show();
                String s = String.valueOf(position);
                Intent i = new Intent(SubActivity.this, SusiroActivity.class);
                i.putExtra("susiyanum",s);
                i.putExtra("KEYWORD",keyword);
                startActivity(i);
            }
        });

    }

}
